---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonConcrete
source: html/a502369e-7656-e2de-9746-cdde024a0f29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.InvalidRebarHostNonConcrete Property

Rebar can't be placed in a structural family unless its [Material Type] is [Concrete].

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRebarHostNonConcrete { get; }
```